# Salary limpieza de datos

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [30]:
dfOriginal=pd.read_csv("Salary_data.csv")
dfCopia=dfOriginal.copy()
#print(dfCopia)
dfCopia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

In [31]:
dfCopia.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
6699     True
6700     True
6701     True
6702     True
6703     True
Length: 6704, dtype: bool

In [32]:
dfCopia.drop_duplicates(inplace=True)

In [33]:
dfCopia.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
6623    False
6624    False
6625    False
6628    False
6631    False
Length: 1792, dtype: bool

In [47]:
dfCopia.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1792 entries, 0 to 6631
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  1791 non-null   float64
 1   Gender               1791 non-null   object
 2   Education Level      1790 non-null   object
 3   Job Title            1791 non-null   object
 4   Years of Experience  1790 non-null   float64
 5   Salary               1788 non-null   float64
dtypes: float64(3), object(3)
memory usage: 98.0+ KB

In [44]:
dfCopia.notnull()

       Age  Gender  Education Level  Job Title  Years of Experience  Salary
0     True    True             True       True                 True    True
1     True    True             True       True                 True    True
2     True    True             True       True                 True    True
3     True    True             True       True                 True    True
4     True    True             True       True                 True    True
...    ...     ...              ...        ...                  ...     ...
6623  True    True             True       True                 True    True
6624  True    True             True       True                 True    True
6625  True    True             True       True                 True    True
6628  True    True             True       True                 True    True
6631  True    True             True       True                 True    True

[1792 rows x 6 columns]

In [ ]:
dfCopia.dropna()